app/controllers/places_controller.rb

SELECT  "places".* FROM "places"  WHERE "places"."place_key" = '1' LIMIT 1
---
  def show
    @place = Place.find_by(:place_key => params["id"])

SELECT  "places".* FROM "places"  WHERE "places"."place_key" = '5' LIMIT 1
---
  def delete
    @place = Place.find_by(:place_key => params["id"]) # Find out what link has been clicked