app/controllers/places_controller.rb

SELECT "places".* FROM "places"
---
  def index
    @places = Place.all

INSERT INTO "places" ("admission_price", "description", "photo_url", "title") VALUES (?, ?, ?, ?)  [["admission_price", 10], ["description", "Good Place to visit"], ["photo_url", "http://www.msichicago.org/fileadmin/Exhibits/permanent/science_storms/ss_hero_608.jpg"], ["title", "MSI"]]
---
  def create
    Place.create(:title => params["title"], :photo_url => params["photo_url"], :admission_price => params["price"],:description => params["description"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 32 LIMIT 1
---
  def show
    @place = Place.find_by(:id=> params["id"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 39 LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 36
---
  def delete
    @place = Place.find_by(:id => params["id"]) # Find out what link has been clicked
    @place.delete # Delete the item which has been clicked

SELECT  "places".* FROM "places"  WHERE "places"."id" = 35 LIMIT 1
---
  def edit
    @place = Place.find_by(:id => params["id"])

SELECT  "places".* FROM "places"  WHERE "places"."id" = 35 LIMIT 1
UPDATE "places" SET "description" = ? WHERE "places"."id" = 52  [["description", "Good Place to visit. Foo Bar"]]
---
  def update
    @place = Place.find_by(:id => params["id"])
    @place.title = params["title"]
    @place.photo_url = params["photo_url"]
    @place.admission_price = params["price"]
    @place.description = params["description"]
    @place.save